In [1]:
import pandas as pd

In [3]:
data = {
    'Nombre' : ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad' : [25, 30, 22, 27],
    'Ciudad' : ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']

}

df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

Cómo agregar una nueva columna con datos

In [4]:
df["Salario"] = [30000, 45000, 38000, 32000]
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

Cómo modificar el contenido de todo una columna ya existente

In [5]:
df["Salario"] = df["Salario"] + 2000
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    32000
1    Luis    30  Barcelona    47000
2  Carlos    22   Valencia    40000
3    Sara    27     Bilbao    34000

Como seleccionar una columna, almacenarla en una variable por fuera del dataframe para trabajarla por separado (como si fueran series)

In [ ]:
nombres = df['Nombre']
nombres #es una serie y pueda trabajarla como tal

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

Cómo filtrar DataFrames, por ejemplo mostrar solo las filas que cuyas edades son > 25

In [9]:
mayores_25 = df[df['Edad'] > 25]
mayores_25

# otra opcion valida
edades = df['Edad']
edades
mayores_25 = df[edades > 25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000

Ejercicio : Crear una nueva columna Es_Mayor_de_25 que contenga valores booleanos: True si la persona tiene 25 años o más, y False en caso contrario.

In [ ]:

data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)



valores_booleanos = df['Edad'] >= 25

df["Es_Mayor_de_25"] = valores_booleanos

df

   Nombre  Edad     Ciudad  Es_Mayor_de_25
0     Ana    25     Madrid            True
1    Luis    30  Barcelona            True
2  Carlos    22   Valencia           False
3    Sara    27     Bilbao            True